; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	image0 - mode
	image1 - mode
	GroundStation0 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation1 - direction
	Star5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 image1)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(supports instrument2 image0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star3)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
	(supports instrument3 image0)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 image0)
	(calibration_target instrument4 Star3)
	(supports instrument5 image0)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation4)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
	(supports instrument6 image0)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation1)
	(supports instrument7 image1)
	(supports instrument7 image0)
	(calibration_target instrument7 GroundStation2)
	(supports instrument8 image0)
	(calibration_target instrument8 GroundStation2)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon6)
	(supports instrument9 image1)
	(supports instrument9 image0)
	(calibration_target instrument9 GroundStation1)
	(supports instrument10 image0)
	(calibration_target instrument10 Star3)
	(supports instrument11 image0)
	(calibration_target instrument11 GroundStation1)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon8)
)
(:goal (and
	(pointing satellite2 GroundStation0)
	(pointing satellite3 Phenomenon8)
	(have_image Star5 image1)
	(have_image Phenomenon6 image1)
	(have_image Star7 image0)
	(have_image Phenomenon8 image1)
	(have_image Planet9 image0)
))

)

; plan
1. (turn_to satellite3 groundstation1 phenomenon6)
   deleted: (pointing satellite3 phenomenon6)
   added: (pointing satellite3 groundstation1)
   goals met: 1 of 7
2. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 1 of 7
3. (calibrate satellite3 instrument6 groundstation1)
   added: (calibrated instrument6)
   goals met: 1 of 7
4. (turn_to satellite3 star5 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 star5)
   goals met: 1 of 7
5. (take_image satellite3 star5 instrument6 image1)
   added: (have_image star5 image1)
   goals met: 2 of 7
6. (turn_to satellite3 planet9 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 planet9)
   goals met: 2 of 7
7. (take_image satellite3 planet9 instrument6 image0)
   added: (have_image planet9 image0)
   goals met: 3 of 7
8. (turn_to satellite3 phenomenon6 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 phenomenon6)
   goals met: 3 of 7
9. (take_image satellite3 phenomenon6 instrument6 image1)
   added: (have_image phenomenon6 image1)
   goals met: 4 of 7
10. (turn_to satellite3 star7 phenomenon6)
   deleted: (pointing satellite3 phenomenon6)
   added: (pointing satellite3 star7)
   goals met: 4 of 7
11. (take_image satellite3 star7 instrument6 image0)
   added: (have_image star7 image0)
   goals met: 5 of 7
12. (turn_to satellite3 phenomenon8 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 phenomenon8)
   goals met: 6 of 7
13. (take_image satellite3 phenomenon8 instrument6 image1)
   added: (have_image phenomenon8 image1)
   goals met: 7 of 7
